ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/adc14.xml
<module id="ADC14" HW_revision=""><register id="CTL0" width="32" offset="0x0" internal="0" description="Control 0 Register "><bitfield id="SC" description="ADC14 start conversion" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="SC__0" value="0" description="No sample-and-conversion-start"/><bitenum id="SC__1" value="1" description="Start sample-and-conversion"/></bitfield><bitfield id="ENC" description="ADC14 enable conversion" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="ENC__0" value="0" description="ADC14 disabled"/><bitenum id="ENC__1" value="1" description="ADC14 enabled"/></bitfield><bitfield id="ON" description="ADC14 on" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="ON__0" value="0" description="ADC14 off"/><bitenum id="ON__1" value="1" description="ADC14 on"/></bitfield><bitfield id="MSC" description="ADC14 multiple sample and conversion" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="MSC__0" value="0" description="The sampling timer requires a rising edge of the SHI signal to "/><bitenum id="MSC__1" value="1" description="The first rising edge of the SHI signal triggers the sampling t"/></bitfield><bitfield id="SHT0" description="ADC14 sample-and-hold time" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="SHT0__0" value="0" description="4"/><bitenum id="SHT0__1" value="1" description="8"/><bitenum id="SHT0__2" value="2" description="16"/><bitenum id="SHT0__3" value="3" description="32"/><bitenum id="SHT0__4" value="4" description="64"/><bitenum id="SHT0__5" value="5" description="96"/><bitenum id="SHT0__6" value="6" description="128"/><bitenum id="SHT0__7" value="7" description="192"/></bitfield><bitfield id="SHT1" description="ADC14 sample-and-hold time" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="SHT1__0" value="0" description="4"/><bitenum id="SHT1__1" value="1" description="8"/><bitenum id="SHT1__2" value="2" description="16"/><bitenum id="SHT1__3" value="3" description="32"/><bitenum id="SHT1__4" value="4" description="64"/><bitenum id="SHT1__5" value="5" description="96"/><bitenum id="SHT1__6" value="6" description="128"/><bitenum id="SHT1__7" value="7" description="192"/></bitfield><bitfield id="BUSY" description="ADC14 busy" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="BUSY__0" value="0" description="No operation is active"/><bitenum id="BUSY__1" value="1" description="A sequence, sample, or conversion is active"/></bitfield><bitfield id="CONSEQ" description="ADC14 conversion sequence mode select" begin="18" end="17" width="2" rwaccess="R/W"><bitenum id="CONSEQ__0" value="0" description="Single-channel, single-conversion"/><bitenum id="CONSEQ__1" value="1" description="Sequence-of-channels"/><bitenum id="CONSEQ__2" value="2" description="Repeat-single-channel"/><bitenum id="CONSEQ__3" value="3" description="Repeat-sequence-of-channels"/></bitfield><bitfield id="SSEL" description="ADC14 clock source select" begin="21" end="19" width="3" rwaccess="R/W"><bitenum id="SSEL__0" value="0" description="MODCLK"/><bitenum id="SSEL__1" value="1" description="SYSCLK"/><bitenum id="SSEL__2" value="2" description="ACLK"/><bitenum id="SSEL__3" value="3" description="MCLK"/><bitenum id="SSEL__4" value="4" description="SMCLK"/><bitenum id="SSEL__5" value="5" description="HSMCLK"/></bitfield><bitfield id="DIV" description="ADC14 clock divider.&#13;&#10;Can be modified only when ADC14ENC = 0." begin="24" end="22" width="3" rwaccess="R/W"><bitenum id="DIV__0" value="0" description="/1"/><bitenum id="DIV__1" value="1" description="/2"/><bitenum id="DIV__2" value="2" description="/3"/><bitenum id="DIV__3" value="3" description="/4"/><bitenum id="DIV__4" value="4" description="/5"/><bitenum id="DIV__5" value="5" description="/6"/><bitenum id="DIV__6" value="6" description="/7"/><bitenum id="DIV__7" value="7" description="/8"/></bitfield><bitfield id="ISSH" description="ADC14 invert signal sample-and-hold" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="ISSH__0" value="0" description="The sample-input signal is not inverted"/><bitenum id="ISSH__1" value="1" description="The sample-input signal is inverted"/></bitfield><bitfield id="SHP" description="ADC14 sample-and-hold pulse-mode select" begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="SHP__0" value="0" description="SAMPCON signal is sourced from the sample-input signal"/><bitenum id="SHP__1" value="1" description="SAMPCON signal is sourced from the sampling timer"/></bitfield><bitfield id="SHS" description="ADC14 sample-and-hold source select" begin="29" end="27" width="3" rwaccess="R/W"><bitenum id="SHS__0" value="0" description="ADC14SC bit"/><bitenum id="SHS__1" value="1" description="See device-specific data sheet for source"/><bitenum id="SHS__2" value="2" description="See device-specific data sheet for source"/><bitenum id="SHS__3" value="3" description="See device-specific data sheet for source"/><bitenum id="SHS__4" value="4" description="See device-specific data sheet for source"/><bitenum id="SHS__5" value="5" description="See device-specific data sheet for source"/><bitenum id="SHS__6" value="6" description="See device-specific data sheet for source"/><bitenum id="SHS__7" value="7" description="See device-specific data sheet for source"/></bitfield><bitfield id="PDIV" description="ADC14 predivider" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="PDIV__0" value="0" description="Predivide by 1"/><bitenum id="PDIV__1" value="1" description="Predivide by 4"/><bitenum id="PDIV__2" value="2" description="Predivide by 32"/><bitenum id="PDIV__3" value="3" description="Predivide by 64"/></bitfield></register><register id="DBG0" width="32" offset="0x0" internal="0" description="Debug Register "><bitfield id="CLKCTRL" description="Clock control during debug." begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="INTCTRL" description="Interrupt control during debug." begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="DMACTRL" description="DMA control during debug." begin="2" end="2" width="1" rwaccess="R/W"/></register><register id="DSCR0" width="32" offset="0x0" internal="0" description="Descriptor Register"><bitfield id="MODREVNO" description="Module revision number." begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="CTL1" width="32" offset="0x4" internal="0" description="Control 1 Register"><bitfield id="PWRMD" description="ADC power modes" begin="1" end="0" width="2" rwaccess="R/W"><bitenum id="PWRMD__0" value="0" description="Regular power mode for use with any resolution setting"/><bitenum id="PWRMD__2" value="2" description="Low-power mode for 12-bit, 10-bit, and 8-bit resolution setting"/></bitfield><bitfield id="REFBURST" description="ADC reference buffer burst" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="REFBURST__0" value="0" description="ADC reference buffer on continuously"/><bitenum id="REFBURST__1" value="1" description="ADC reference buffer on only during sample-and-conversion"/></bitfield><bitfield id="DF" description="ADC14 data read-back format" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="DF__0" value="0" description="Binary unsigned"/><bitenum id="DF__1" value="1" description="Signed binary (2s complement), left aligned"/></bitfield><bitfield id="RES" description="ADC14 resolution" begin="5" end="4" width="2" rwaccess="R/W"><bitenum id="RES__0" value="0" description="8 bit (9 clock cycle conversion time)"/><bitenum id="RES__1" value="1" description="10 bit (11 clock cycle conversion time)"/><bitenum id="RES__2" value="2" description="12 bit (14 clock cycle conversion time)"/><bitenum id="RES__3" value="3" description="14 bit (16 clock cycle conversion time)"/></bitfield><bitfield id="CSTARTADD" description="ADC14 conversion start address" begin="20" end="16" width="5" rwaccess="R/W"/><bitfield id="BATMAP" description="Controls 1/2 AVCC ADC input channel selection." begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="BATMAP__0" value="0" description="ADC internal 1/2 x AVCC channel is not selected for ADC"/><bitenum id="BATMAP__1" value="1" description="ADC internal 1/2 x AVCC channel is selected for ADC input chann"/></bitfield><bitfield id="TCMAP" description="Controls temperature sensor ADC input channel selection" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="TCMAP__0" value="0" description="ADC internal temperature sensor channel is not selected for ADC"/><bitenum id="TCMAP__1" value="1" description="ADC internal temperature sensor channel is selected for ADC inp"/></bitfield><bitfield id="CH0MAP" description="Controls internal channel 0 selection to ADC input channel MAX-2" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="CH0MAP__0" value="0" description="ADC input channel internal 0 is not selected"/><bitenum id="CH0MAP__1" value="1" description="ADC input channel internal 0 is selected for ADC input channel "/></bitfield><bitfield id="CH1MAP" description="Controls internal channel 1 selection to ADC input channel MAX-3" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="CH1MAP__0" value="0" description="ADC input channel internal 1 is not selected"/><bitenum id="CH1MAP__1" value="1" description="ADC input channel internal 1 is selected for ADC input channel "/></bitfield><bitfield id="CH2MAP" description="Controls internal channel 2 selection to ADC input channel MAX-4" begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="CH2MAP__0" value="0" description="ADC input channel internal 2 is not selected"/><bitenum id="CH2MAP__1" value="1" description="ADC input channel internal 2 is selected for ADC input channel "/></bitfield><bitfield id="CH3MAP" description="Controls internal channel 3 selection to ADC input channel MAX-5" begin="27" end="27" width="1" rwaccess="R/W"><bitenum id="CH3MAP__0" value="0" description="ADC input channel internal 3 is not selected"/><bitenum id="CH3MAP__1" value="1" description="ADC input channel internal 3 is selected for ADC input channel "/></bitfield></register><register id="LO0" width="32" offset="0x8" internal="0" description="Window Comparator Low Threshold 0 Register "><bitfield id="LO0" description="Low threshold 0" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="HI0" width="32" offset="0xC" internal="0" description="Window Comparator High Threshold 0 Register "><bitfield id="HI0" description="High threshold 0" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="LO1" width="32" offset="0x10" internal="0" description="Window Comparator Low Threshold 1 Register "><bitfield id="LO1" description="Low threshold 1" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="HI1" width="32" offset="0x14" internal="0" description="Window Comparator High Threshold 1 Register "><bitfield id="HI1" description="High threshold 1" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MCTL0" width="32" offset="0x18" internal="0" description="Conversion Memory Control Register"><bitfield id="INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="INCH__0" value="0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__1" value="1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__2" value="2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__3" value="3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__4" value="4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__5" value="5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__6" value="6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__7" value="7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__8" value="8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__9" value="9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__16" value="10" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__17" value="11" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__18" value="12" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__19" value="13" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__20" value="14" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__21" value="15" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__22" value="16" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__23" value="17" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__24" value="18" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__25" value="19" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__32" value="20" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__33" value="21" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__34" value="22" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__35" value="23" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__36" value="24" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__37" value="25" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__38" value="26" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__39" value="27" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__40" value="28" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__41" value="29" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__48" value="30" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/><bitenum id="INCH__49" value="31" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/></bitfield><bitfield id="EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="EOS__0" value="0" description="Not end of sequence"/><bitenum id="EOS__1" value="1" description="End of sequence"/></bitfield><bitfield id="VRSEL" description="Selects combinations of V(R+) and V(R-) sources as well as the " begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="VRSEL__0" value="0" description="V(R+) = AVCC, V(R-) = AVSS"/><bitenum id="VRSEL__1" value="1" description="V(R+) = VREF buffered, V(R-) = AVSS"/><bitenum id="VRSEL__20" value="14" description="V(R+) = VeREF+, V(R-) = VeREF-"/><bitenum id="VRSEL__21" value="15" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/></bitfield><bitfield id="DIF" description="Differential mode.&#13;&#10;Can be modified only when ADC14ENC = 0." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="DIF__0" value="0" description="Single-ended mode enabled"/><bitenum id="DIF__1" value="1" description="Differential mode enabled"/></bitfield><bitfield id="WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="WINC__0" value="0" description="Comparator window disabled"/><bitenum id="WINC__1" value="1" description="Comparator window enabled"/></bitfield><bitfield id="WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="WINCTH__0" value="0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/><bitenum id="WINCTH__1" value="1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/></bitfield></register><register id="MCTL1" width="32" offset="0x1C" internal="0" description="Conversion Memory Control Register"><bitfield id="INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="INCH__0" value="0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__1" value="1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__2" value="2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__3" value="3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__4" value="4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__5" value="5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__6" value="6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__7" value="7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__8" value="8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__9" value="9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__16" value="10" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__17" value="11" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__18" value="12" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__19" value="13" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__20" value="14" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__21" value="15" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__22" value="16" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__23" value="17" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__24" value="18" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__25" value="19" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__32" value="20" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__33" value="21" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__34" value="22" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__35" value="23" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__36" value="24" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__37" value="25" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__38" value="26" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__39" value="27" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__40" value="28" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__41" value="29" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__48" value="30" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/><bitenum id="INCH__49" value="31" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/></bitfield><bitfield id="EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="EOS__0" value="0" description="Not end of sequence"/><bitenum id="EOS__1" value="1" description="End of sequence"/></bitfield><bitfield id="VRSEL" description="Selects combinations of V(R+) and V(R-) sources as well as the " begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="VRSEL__0" value="0" description="V(R+) = AVCC, V(R-) = AVSS"/><bitenum id="VRSEL__1" value="1" description="V(R+) = VREF buffered, V(R-) = AVSS"/><bitenum id="VRSEL__20" value="14" description="V(R+) = VeREF+, V(R-) = VeREF-"/><bitenum id="VRSEL__21" value="15" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/></bitfield><bitfield id="DIF" description="Differential mode.&#13;&#10;Can be modified only when ADC14ENC = 0." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="DIF__0" value="0" description="Single-ended mode enabled"/><bitenum id="DIF__1" value="1" description="Differential mode enabled"/></bitfield><bitfield id="WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="WINC__0" value="0" description="Comparator window disabled"/><bitenum id="WINC__1" value="1" description="Comparator window enabled"/></bitfield><bitfield id="WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="WINCTH__0" value="0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/><bitenum id="WINCTH__1" value="1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/></bitfield></register><register id="MCTL2" width="32" offset="0x20" internal="0" description="Conversion Memory Control Register"><bitfield id="INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="INCH__0" value="0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__1" value="1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__2" value="2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__3" value="3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__4" value="4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__5" value="5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__6" value="6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__7" value="7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__8" value="8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__9" value="9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__16" value="10" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__17" value="11" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__18" value="12" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__19" value="13" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__20" value="14" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__21" value="15" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__22" value="16" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__23" value="17" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__24" value="18" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__25" value="19" description="If ADC14DIF = 0: A19; If ADC14DIF =