ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/adc14.xml
 id="INCH__19" value="13" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__20" value="14" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__21" value="15" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__22" value="16" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__23" value="17" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__24" value="18" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__25" value="19" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__32" value="20" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__33" value="21" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__34" value="22" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__35" value="23" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__36" value="24" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__37" value="25" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__38" value="26" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__39" value="27" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__40" value="28" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__41" value="29" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__48" value="30" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/><bitenum id="INCH__49" value="31" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/></bitfield><bitfield id="EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="EOS__0" value="0" description="Not end of sequence"/><bitenum id="EOS__1" value="1" description="End of sequence"/></bitfield><bitfield id="VRSEL" description="Selects combinations of V(R+) and V(R-) sources as well as the " begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="VRSEL__0" value="0" description="V(R+) = AVCC, V(R-) = AVSS"/><bitenum id="VRSEL__1" value="1" description="V(R+) = VREF buffered, V(R-) = AVSS"/><bitenum id="VRSEL__20" value="14" description="V(R+) = VeREF+, V(R-) = VeREF-"/><bitenum id="VRSEL__21" value="15" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/></bitfield><bitfield id="DIF" description="Differential mode.&#13;&#10;Can be modified only when ADC14ENC = 0." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="DIF__0" value="0" description="Single-ended mode enabled"/><bitenum id="DIF__1" value="1" description="Differential mode enabled"/></bitfield><bitfield id="WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="WINC__0" value="0" description="Comparator window disabled"/><bitenum id="WINC__1" value="1" description="Comparator window enabled"/></bitfield><bitfield id="WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="WINCTH__0" value="0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/><bitenum id="WINCTH__1" value="1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/></bitfield></register><register id="MCTL30" width="32" offset="0x90" internal="0" description="Conversion Memory Control Register"><bitfield id="INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="INCH__0" value="0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__1" value="1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__2" value="2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__3" value="3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__4" value="4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__5" value="5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__6" value="6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__7" value="7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__8" value="8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__9" value="9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__16" value="10" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__17" value="11" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__18" value="12" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__19" value="13" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__20" value="14" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__21" value="15" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__22" value="16" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__23" value="17" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__24" value="18" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__25" value="19" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__32" value="20" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__33" value="21" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__34" value="22" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__35" value="23" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__36" value="24" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__37" value="25" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__38" value="26" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__39" value="27" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__40" value="28" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__41" value="29" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__48" value="30" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/><bitenum id="INCH__49" value="31" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/></bitfield><bitfield id="EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="EOS__0" value="0" description="Not end of sequence"/><bitenum id="EOS__1" value="1" description="End of sequence"/></bitfield><bitfield id="VRSEL" description="Selects combinations of V(R+) and V(R-) sources as well as the " begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="VRSEL__0" value="0" description="V(R+) = AVCC, V(R-) = AVSS"/><bitenum id="VRSEL__1" value="1" description="V(R+) = VREF buffered, V(R-) = AVSS"/><bitenum id="VRSEL__20" value="14" description="V(R+) = VeREF+, V(R-) = VeREF-"/><bitenum id="VRSEL__21" value="15" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/></bitfield><bitfield id="DIF" description="Differential mode.&#13;&#10;Can be modified only when ADC14ENC = 0." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="DIF__0" value="0" description="Single-ended mode enabled"/><bitenum id="DIF__1" value="1" description="Differential mode enabled"/></bitfield><bitfield id="WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="WINC__0" value="0" description="Comparator window disabled"/><bitenum id="WINC__1" value="1" description="Comparator window enabled"/></bitfield><bitfield id="WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="WINCTH__0" value="0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/><bitenum id="WINCTH__1" value="1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/></bitfield></register><register id="MCTL31" width="32" offset="0x94" internal="0" description="Conversion Memory Control Register"><bitfield id="INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="INCH__0" value="0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__1" value="1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/><bitenum id="INCH__2" value="2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__3" value="3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/><bitenum id="INCH__4" value="4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__5" value="5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/><bitenum id="INCH__6" value="6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__7" value="7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/><bitenum id="INCH__8" value="8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__9" value="9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/><bitenum id="INCH__16" value="10" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__17" value="11" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/><bitenum id="INCH__18" value="12" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__19" value="13" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/><bitenum id="INCH__20" value="14" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__21" value="15" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/><bitenum id="INCH__22" value="16" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__23" value="17" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/><bitenum id="INCH__24" value="18" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__25" value="19" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/><bitenum id="INCH__32" value="20" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__33" value="21" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/><bitenum id="INCH__34" value="22" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__35" value="23" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/><bitenum id="INCH__36" value="24" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__37" value="25" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/><bitenum id="INCH__38" value="26" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__39" value="27" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/><bitenum id="INCH__40" value="28" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__41" value="29" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/><bitenum id="INCH__48" value="30" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/><bitenum id="INCH__49" value="31" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/></bitfield><bitfield id="EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="EOS__0" value="0" description="Not end of sequence"/><bitenum id="EOS__1" value="1" description="End of sequence"/></bitfield><bitfield id="VRSEL" description="Selects combinations of V(R+) and V(R-) sources as well as the " begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="VRSEL__0" value="0" description="V(R+) = AVCC, V(R-) = AVSS"/><bitenum id="VRSEL__1" value="1" description="V(R+) = VREF buffered, V(R-) = AVSS"/><bitenum id="VRSEL__20" value="14" description="V(R+) = VeREF+, V(R-) = VeREF-"/><bitenum id="VRSEL__21" value="15" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/></bitfield><bitfield id="DIF" description="Differential mode.&#13;&#10;Can be modified only when ADC14ENC = 0." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="DIF__0" value="0" description="Single-ended mode enabled"/><bitenum id="DIF__1" value="1" description="Differential mode enabled"/></bitfield><bitfield id="WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="WINC__0" value="0" description="Comparator window disabled"/><bitenum id="WINC__1" value="1" description="Comparator window enabled"/></bitfield><bitfield id="WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="WINCTH__0" value="0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/><bitenum id="WINCTH__1" value="1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/></bitfield></register><register id="MEM0" width="32" offset="0x98" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM1" width="32" offset="0x9C" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM2" width="32" offset="0xA0" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM3" width="32" offset="0xA4" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM4" width="32" offset="0xA8" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM5" width="32" offset="0xAC" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM6" width="32" offset="0xB0" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM7" width="32" offset="0xB4" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM8" width="32" offset="0xB8" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM9" width="32" offset="0xBC" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM10" width="32" offset="0xC0" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM11" width="32" offset="0xC4" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM12" width="32" offset="0xC8" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM13" width="32" offset="0xCC" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM14" width="32" offset="0xD0" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM15" width="32" offset="0xD4" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM16" width="32" offset="0xD8" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM17" width="32" offset="0xDC" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM18" width="32" offset="0xE0" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM19" width="32" offset="0xE4" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM20" width="32" offset="0xE8" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM21" width="32" offset="0xEC" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM22" width="32" offset="0xF0" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM23" width="32" offset="0xF4" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM24" width="32" offset="0xF8" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM25" width="32" offset="0xFC" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM26" width="32" offset="0x100" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM27" width="32" offset="0x104" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM28" width="32" offset="0x108" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM29" width="32" offset="0x10C" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM30" width="32" offset="0x110" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MEM31" width="32" offset="0x114" internal="0" description="Conversion Memory Register"><bitfield id="CONVRES" description="If ADC14DF = 0, unsigned binary:&#13;&#10;The 14-bit conversion results" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="IER0" width="32" offset="0x13C" internal="0" description="Interrupt Enable 0 Register "><bitfield id="IE0" description="Interrupt enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="IE0__0" value="0" description="Interrupt disabled"/><bitenum id="IE0__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE1" description="Interrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="IE1__0" value="0" description="Interrupt disabled"/><bitenum id="IE1__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE2" description="Interrupt enable" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="IE2__0" value="0" description="Interrupt disabled"/><bitenum id="IE2__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE3" description="Interrupt enable" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="IE3__0" value="0" description="Interrupt disabled"/><bitenum id="IE3__1" value="1" description="Interrupt enab