ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/adc14.xml
led"/></bitfield><bitfield id="IE4" description="Interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="IE4__0" value="0" description="Interrupt disabled"/><bitenum id="IE4__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE5" description="Interrupt enable" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="IE5__0" value="0" description="Interrupt disabled"/><bitenum id="IE5__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE6" description="Interrupt enable" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="IE6__0" value="0" description="Interrupt disabled"/><bitenum id="IE6__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE7" description="Interrupt enable" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="IE7__0" value="0" description="Interrupt disabled"/><bitenum id="IE7__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE8" description="Interrupt enable" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="IE8__0" value="0" description="Interrupt disabled"/><bitenum id="IE8__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE9" description="Interrupt enable" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="IE9__0" value="0" description="Interrupt disabled"/><bitenum id="IE9__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE10" description="Interrupt enable" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="IE10__0" value="0" description="Interrupt disabled"/><bitenum id="IE10__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE11" description="Interrupt enable" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="IE11__0" value="0" description="Interrupt disabled"/><bitenum id="IE11__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE12" description="Interrupt enable" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="IE12__0" value="0" description="Interrupt disabled"/><bitenum id="IE12__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE13" description="Interrupt enable" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="IE13__0" value="0" description="Interrupt disabled"/><bitenum id="IE13__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE14" description="Interrupt enable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="IE14__0" value="0" description="Interrupt disabled"/><bitenum id="IE14__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE15" description="Interrupt enable" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="IE15__0" value="0" description="Interrupt disabled"/><bitenum id="IE15__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE16" description="Interrupt enable" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="IE16__0" value="0" description="Interrupt disabled"/><bitenum id="IE16__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE17" description="Interrupt enable" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="IE17__0" value="0" description="Interrupt disabled"/><bitenum id="IE17__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE18" description="Interrupt enable" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="IE18__0" value="0" description="Interrupt disabled"/><bitenum id="IE18__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE19" description="Interrupt enable" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="IE19__0" value="0" description="Interrupt disabled"/><bitenum id="IE19__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE20" description="Interrupt enable" begin="20" end="20" width="1" rwaccess="R/W"><bitenum id="IE20__0" value="0" description="Interrupt disabled"/><bitenum id="IE20__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE21" description="Interrupt enable" begin="21" end="21" width="1" rwaccess="R/W"><bitenum id="IE21__0" value="0" description="Interrupt disabled"/><bitenum id="IE21__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE22" description="Interrupt enable" begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="IE22__0" value="0" description="Interrupt disabled"/><bitenum id="IE22__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE23" description="Interrupt enable" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="IE23__0" value="0" description="Interrupt disabled"/><bitenum id="IE23__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE24" description="Interrupt enable" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="IE24__0" value="0" description="Interrupt disabled"/><bitenum id="IE24__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE25" description="Interrupt enable" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="IE25__0" value="0" description="Interrupt disabled"/><bitenum id="IE25__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE26" description="Interrupt enable" begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="IE26__0" value="0" description="Interrupt disabled"/><bitenum id="IE26__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE27" description="Interrupt enable" begin="27" end="27" width="1" rwaccess="R/W"><bitenum id="IE27__0" value="0" description="Interrupt disabled"/><bitenum id="IE27__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE28" description="Interrupt enable" begin="28" end="28" width="1" rwaccess="R/W"><bitenum id="IE28__0" value="0" description="Interrupt disabled"/><bitenum id="IE28__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE29" description="Interrupt enable" begin="29" end="29" width="1" rwaccess="R/W"><bitenum id="IE29__0" value="0" description="Interrupt disabled"/><bitenum id="IE29__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE30" description="Interrupt enable" begin="30" end="30" width="1" rwaccess="R/W"><bitenum id="IE30__0" value="0" description="Interrupt disabled"/><bitenum id="IE30__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IE31" description="Interrupt enable" begin="31" end="31" width="1" rwaccess="R/W"><bitenum id="IE31__0" value="0" description="Interrupt disabled"/><bitenum id="IE31__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IER1" width="32" offset="0x140" internal="0" description="Interrupt Enable 1 Register "><bitfield id="INIE" description="Interrupt enable for the ADC14MEMx result register being greate" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="INIE__0" value="0" description="Interrupt disabled"/><bitenum id="INIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="LOIE" description="Interrupt enable for the falling short of the lower limit inter" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="LOIE__0" value="0" description="Interrupt disabled"/><bitenum id="LOIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="HIIE" description="Interrupt enable for the exceeding the upper limit interrupt of" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="HIIE__0" value="0" description="Interrupt disabled"/><bitenum id="HIIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OVIE" description="ADC14MEMx overflow-interrupt enable." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="OVIE__0" value="0" description="Interrupt disabled"/><bitenum id="OVIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TOVIE" description="ADC14 conversion-time-overflow interrupt enable." begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="TOVIE__0" value="0" description="Interrupt disabled"/><bitenum id="TOVIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="RDYIE" description="ADC14 local buffered reference ready interrupt enable." begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="RDYIE__0" value="0" description="Interrupt disabled"/><bitenum id="RDYIE__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IFGR0" width="32" offset="0x144" internal="0" description="Interrupt Flag 0 Register "><bitfield id="IFG0" description="ADC14MEM0 interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="IFG0__0" value="0" description="No interrupt pending"/><bitenum id="IFG0__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG1" description="ADC14MEM1 interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="IFG1__0" value="0" description="No interrupt pending"/><bitenum id="IFG1__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG2" description="ADC14MEM2 interrupt flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="IFG2__0" value="0" description="No interrupt pending"/><bitenum id="IFG2__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG3" description="ADC14MEM3 interrupt flag" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="IFG3__0" value="0" description="No interrupt pending"/><bitenum id="IFG3__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG4" description="ADC14MEM4 interrupt flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="IFG4__0" value="0" description="No interrupt pending"/><bitenum id="IFG4__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG5" description="ADC14MEM5 interrupt flag" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="IFG5__0" value="0" description="No interrupt pending"/><bitenum id="IFG5__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG6" description="ADC14MEM6 interrupt flag" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="IFG6__0" value="0" description="No interrupt pending"/><bitenum id="IFG6__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG7" description="ADC14MEM7 interrupt flag" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="IFG7__0" value="0" description="No interrupt pending"/><bitenum id="IFG7__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG8" description="ADC14MEM8 interrupt flag" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="IFG8__0" value="0" description="No interrupt pending"/><bitenum id="IFG8__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG9" description="ADC14MEM9 interrupt flag" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="IFG9__0" value="0" description="No interrupt pending"/><bitenum id="IFG9__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG10" description="ADC14MEM10 interrupt flag" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="IFG10__0" value="0" description="No interrupt pending"/><bitenum id="IFG10__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG11" description="ADC14MEM11 interrupt flag" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="IFG11__0" value="0" description="No interrupt pending"/><bitenum id="IFG11__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG12" description="ADC14MEM12 interrupt flag" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="IFG12__0" value="0" description="No interrupt pending"/><bitenum id="IFG12__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG13" description="ADC14MEM13 interrupt flag" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="IFG13__0" value="0" description="No interrupt pending"/><bitenum id="IFG13__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG14" description="ADC14MEM14 interrupt flag" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="IFG14__0" value="0" description="No interrupt pending"/><bitenum id="IFG14__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG15" description="ADC14MEM15 interrupt flag" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="IFG15__0" value="0" description="No interrupt pending"/><bitenum id="IFG15__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG16" description="ADC14MEM16 interrupt flag" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="IFG16__0" value="0" description="No interrupt pending"/><bitenum id="IFG16__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG17" description="ADC14MEM17 interrupt flag" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="IFG17__0" value="0" description="No interrupt pending"/><bitenum id="IFG17__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG18" description="ADC14MEM18 interrupt flag" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="IFG18__0" value="0" description="No interrupt pending"/><bitenum id="IFG18__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG19" description="ADC14MEM19 interrupt flag" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="IFG19__0" value="0" description="No interrupt pending"/><bitenum id="IFG19__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG20" description="ADC14MEM20 interrupt flag" begin="20" end="20" width="1" rwaccess="R/W"><bitenum id="IFG20__0" value="0" description="No interrupt pending"/><bitenum id="IFG20__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG21" description="ADC14MEM21 interrupt flag" begin="21" end="21" width="1" rwaccess="R/W"><bitenum id="IFG21__0" value="0" description="No interrupt pending"/><bitenum id="IFG21__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG22" description="ADC14MEM22 interrupt flag" begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="IFG22__0" value="0" description="No interrupt pending"/><bitenum id="IFG22__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG23" description="ADC14MEM23 interrupt flag" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="IFG23__0" value="0" description="No interrupt pending"/><bitenum id="IFG23__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG24" description="ADC14MEM24 interrupt flag" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="IFG24__0" value="0" description="No interrupt pending"/><bitenum id="IFG24__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG25" description="ADC14MEM25 interrupt flag" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="IFG25__0" value="0" description="No interrupt pending"/><bitenum id="IFG25__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG26" description="ADC14MEM26 interrupt flag" begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="IFG26__0" value="0" description="No interrupt pending"/><bitenum id="IFG26__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG27" description="ADC14MEM27 interrupt flag" begin="27" end="27" width="1" rwaccess="R/W"><bitenum id="IFG27__0" value="0" description="No interrupt pending"/><bitenum id="IFG27__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG28" description="ADC14MEM28 interrupt flag" begin="28" end="28" width="1" rwaccess="R/W"><bitenum id="IFG28__0" value="0" description="No interrupt pending"/><bitenum id="IFG28__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG29" description="ADC14MEM29 interrupt flag" begin="29" end="29" width="1" rwaccess="R/W"><bitenum id="IFG29__0" value="0" description="No interrupt pending"/><bitenum id="IFG29__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG30" description="ADC14MEM30 interrupt flag" begin="30" end="30" width="1" rwaccess="R/W"><bitenum id="IFG30__0" value="0" description="No interrupt pending"/><bitenum id="IFG30__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IFG31" description="ADC14MEM31 interrupt flag" begin="31" end="31" width="1" rwaccess="R/W"><bitenum id="IFG31__0" value="0" description="No interrupt pending"/><bitenum id="IFG31__1" value="1" description="Interrupt pending"/></bitfield></register><register id="IFGR1" width="32" offset="0x148" internal="0" description="Interrupt Flag 1 Register "><bitfield id="INIFG" description="Interrupt flag for the ADC14MEMx result register being greater " begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="INIFG__0" value="0" description="No interrupt pending"/><bitenum id="INIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="LOIFG" description="Interrupt flag for falling short of the lower limit interrupt o" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="LOIFG__0" value="0" description="No interrupt pending"/><bitenum id="LOIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="HIIFG" description="Interrupt flag for exceeding the upper limit interrupt of the w" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="HIIFG__0" value="0" description="No interrupt pending"/><bitenum id="HIIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="OVIFG" description="ADC14MEMx overflow interrupt flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="OVIFG__0" value="0" description="No interrupt pending"/><bitenum id="OVIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TOVIFG" description="ADC14 conversion time overflow interrupt flag" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="TOVIFG__0" value="0" description="No interrupt pending"/><bitenum id="TOVIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="RDYIFG" description="ADC14 local buffered reference ready interrupt flag" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="RDYIFG__0" value="0" description="No interrupt pending"/><bitenum id="RDYIFG__1" value="1" description="Interrupt pending"/></bitfield></register><register id="CLRIFGR0" width="32" offset="0x14C" internal="0" description="Clear Interrupt Flag 0 Register "><bitfield id="CLRIFG0" description="clear ADC14IFG0" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CLRIFG0__0" value="0" description="no effect"/><bitenum id="CLRIFG0__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG1" description="clear ADC14IFG1" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="CLRIFG1__0" value="0" description="no effect"/><bitenum id="CLRIFG1__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG2" description="clear ADC14IFG2" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="CLRIFG2__0" value="0" description="no effect"/><bitenum id="CLRIFG2__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG3" description="clear ADC14IFG3" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="CLRIFG3__0" value="0" description="no effect"/><bitenum id="CLRIFG3__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG4" description="clear ADC14IFG4" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CLRIFG4__0" value="0" description="no effect"/><bitenum id="CLRIFG4__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG5" description="clear ADC14IFG5" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="CLRIFG5__0" value="0" description="no effect"/><bitenum id="CLRIFG5__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG6" description="clear ADC14IFG6" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="CLRIFG6__0" value="0" description="no effect"/><bitenum id="CLRIFG6__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG7" description="clear ADC14IFG7" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="CLRIFG7__0" value="0" description="no effect"/><bitenum id="CLRIFG7__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG8" description="clear ADC14IFG8" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CLRIFG8__0" value="0" description="no effect"/><bitenum id="CLRIFG8__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG9" description="clear ADC14IFG9" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="CLRIFG9__0" value="0" description="no effect"/><bitenum id="CLRIFG9__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG10" description="clear ADC14IFG10" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="CLRIFG10__0" value="0" description="no effect"/><bitenum id="CLRIFG10__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG11" description="clear ADC14IFG11" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="CLRIFG11__0" value="0" description="no effect"/><bitenum id="CLRIFG11__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG12" description="clear ADC14IFG12" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="CLRIFG12__0" value="0" description="no effect"/><bitenum id="CLRIFG12__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG13" description="clear ADC14IFG13" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="CLRIFG13__0" value="0" description="no effect"/><bitenum id="CLRIFG13__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG14" description="clear ADC14IFG14" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="CLRIFG14__0" value="0" description="no effect"/><bitenum id="CLRIFG14__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG15" description="clear ADC14IFG15" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="CLRIFG15__0" value="0" description="no effect"/><bitenum id="CLRIFG15__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG16" description="clear ADC14IFG16" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="CLRIFG16__0" value="0" description="no effect"/><bitenum id="CLRIFG16__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG17" description="clear ADC14IFG17" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="CLRIFG17__0" value="0" description="no effect"/><bitenum id="CLRIFG17__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG18" description="clear ADC14IFG18" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="CLRIFG18__0" value="0" description="no effect"/><bitenum id="CLRIFG18__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG19" description="clear ADC14IFG19" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="CLRIFG19__0" value="0" description="no effect"/><bitenum id="CLRIFG19__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG20" description="clear ADC14IFG20" begin="20" end="20" width="1" rwaccess="R/W"><bitenum id="CLRIFG20__0" value="0" description="no effect"/><bitenum id="CLRIFG20__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG21" description="clear ADC14IFG21" begin="21" end="21" width="1" rwaccess="R/W"><bitenum id="CLRIFG21__0" value="0" description="no effect"/><bitenum id="CLRIFG21__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG22" description="clear ADC14IFG22" begin="22" end="22" w