ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/adc14.xml
idth="1" rwaccess="R/W"><bitenum id="CLRIFG22__0" value="0" description="no effect"/><bitenum id="CLRIFG22__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG23" description="clear ADC14IFG23" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="CLRIFG23__0" value="0" description="no effect"/><bitenum id="CLRIFG23__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG24" description="clear ADC14IFG24" begin="24" end="24" width="1" rwaccess="R/W"><bitenum id="CLRIFG24__0" value="0" description="no effect"/><bitenum id="CLRIFG24__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG25" description="clear ADC14IFG25" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="CLRIFG25__0" value="0" description="no effect"/><bitenum id="CLRIFG25__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG26" description="clear ADC14IFG26" begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="CLRIFG26__0" value="0" description="no effect"/><bitenum id="CLRIFG26__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG27" description="clear ADC14IFG27" begin="27" end="27" width="1" rwaccess="R/W"><bitenum id="CLRIFG27__0" value="0" description="no effect"/><bitenum id="CLRIFG27__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG28" description="clear ADC14IFG28" begin="28" end="28" width="1" rwaccess="R/W"><bitenum id="CLRIFG28__0" value="0" description="no effect"/><bitenum id="CLRIFG28__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG29" description="clear ADC14IFG29" begin="29" end="29" width="1" rwaccess="R/W"><bitenum id="CLRIFG29__0" value="0" description="no effect"/><bitenum id="CLRIFG29__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG30" description="clear ADC14IFG30" begin="30" end="30" width="1" rwaccess="R/W"><bitenum id="CLRIFG30__0" value="0" description="no effect"/><bitenum id="CLRIFG30__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRIFG31" description="clear ADC14IFG31" begin="31" end="31" width="1" rwaccess="R/W"><bitenum id="CLRIFG31__0" value="0" description="no effect"/><bitenum id="CLRIFG31__1" value="1" description="clear pending interrupt flag"/></bitfield></register><register id="CLRIFGR1" width="32" offset="0x150" internal="0" description="Clear Interrupt Flag 1 Register "><bitfield id="CLRINIFG" description="clear ADC14INIFG" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="CLRINIFG__0" value="0" description="no effect"/><bitenum id="CLRINIFG__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRLOIFG" description="clear ADC14LOIFG" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="CLRLOIFG__0" value="0" description="no effect"/><bitenum id="CLRLOIFG__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRHIIFG" description="clear ADC14HIIFG" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="CLRHIIFG__0" value="0" description="no effect"/><bitenum id="CLRHIIFG__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLROVIFG" description="clear ADC14OVIFG" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CLROVIFG__0" value="0" description="no effect"/><bitenum id="CLROVIFG__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRTOVIFG" description="clear ADC14TOVIFG" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="CLRTOVIFG__0" value="0" description="no effect"/><bitenum id="CLRTOVIFG__1" value="1" description="clear pending interrupt flag"/></bitfield><bitfield id="CLRRDYIFG" description="clear ADC14RDYIFG" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="CLRRDYIFG__0" value="0" description="no effect"/><bitenum id="CLRRDYIFG__1" value="1" description="clear pending interrupt flag"/></bitfield></register><register id="IV" width="32" offset="0x154" internal="0" description="Interrupt Vector Register"><bitfield id="IV" description="ADC14 interrupt vector value" begin="31" end="0" width="32" rwaccess="R/W"><bitenum id="IV__0" value="0" description="No interrupt pending"/><bitenum id="IV__2" value="2" description="Interrupt Source: ADC14MEMx overflow; Interrupt Flag: ADC14OVIF"/><bitenum id="IV__4" value="4" description="Interrupt Source: Conversion time overflow; Interrupt Flag: ADC"/><bitenum id="IV__6" value="6" description="Interrupt Source: ADC14 window high interrupt flag; Interrupt F"/><bitenum id="IV__8" value="8" description="Interrupt Source: ADC14 window low interrupt flag; Interrupt Fl"/><bitenum id="IV__16" value="10" description="Interrupt Source: ADC14 in-window interrupt flag; Interrupt Fla"/><bitenum id="IV__18" value="12" description="Interrupt Source: ADC14MEM0 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__20" value="14" description=""/><bitenum id="IV__22" value="16" description="Interrupt Source: ADC14MEM2 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__24" value="18" description="Interrupt Source: ADC14MEM3 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__32" value="20" description="Interrupt Source: ADC14MEM4 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__34" value="22" description="Interrupt Source: ADC14MEM5 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__36" value="24" description="Interrupt Source: ADC14MEM6 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__38" value="26" description="Interrupt Source: ADC14MEM7 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__40" value="28" description="Interrupt Source: ADC14MEM8 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__48" value="30" description="Interrupt Source: ADC14MEM9 interrupt flag; Interrupt Flag: ADC"/><bitenum id="IV__50" value="32" description="Interrupt Source: ADC14MEM10 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__52" value="34" description="Interrupt Source: ADC14MEM11 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__54" value="36" description="Interrupt Source: ADC14MEM12 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__56" value="38" description="Interrupt Source: ADC14MEM13 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__64" value="40" description="Interrupt Source: ADC14MEM14 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__66" value="42" description="Interrupt Source: ADC14MEM15 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__68" value="44" description="Interrupt Source: ADC14MEM16 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__70" value="46" description="Interrupt Source: ADC14MEM17 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__72" value="48" description="Interrupt Source: ADC14MEM18 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__80" value="50" description="Interrupt Source: ADC14MEM19 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__82" value="52" description="Interrupt Source: ADC14MEM20 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__84" value="54" description="Interrupt Source: ADC14MEM22 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__86" value="56" description="Interrupt Source: ADC14MEM22 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__88" value="58" description="Interrupt Source: ADC14MEM23 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__96" value="60" description="Interrupt Source: ADC14MEM24 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__98" value="62" description="Interrupt Source: ADC14MEM25 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__100" value="64" description="Interrupt Source: ADC14MEM26 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__102" value="66" description="Interrupt Source: ADC14MEM27 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__104" value="68" description="Interrupt Source: ADC14MEM28 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__112" value="70" description="Interrupt Source: ADC14MEM29 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__114" value="72" description="Interrupt Source: ADC14MEM30 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__116" value="74" description="Interrupt Source: ADC14MEM31 interrupt flag; Interrupt Flag: AD"/><bitenum id="IV__118" value="76" description="Interrupt Source: ADC14RDYIFG interrupt flag; Interrupt Flag: A"/></bitfield></register></module>